
/**
 * 这个类是测试分割符的。
 * 分隔符：语句与代码之间的分割
 * 1. 分号（;）：语句的分割，表示一句话结束，好比咱们使用的句号。
 *	2. 花括号（{}）：表示一个代码块，是一个整体，花括号要成对使用。
 *	3. 方括号（[]）：定义数组和访问数组元素时使用。
 *	4. 圆括号（()）：使用很广泛，具体用到细讲。
 *	5. 圆点（.）：类和对象访问它的成员时使用。（的） 
 *	6. 空格[ ]：把一整条语句分割成几段，空格的次数不限制。一般单词之间一个空格就可以了
 * @author EDY
 *
 */
//空格[ ]：把一整条语句分割成几段，空格的次数不限制。
public class Test02 {//花括号（{}）：表示一个代码块，是一个整体，花括号要成对使用。

	//4. 圆括号（()）：使用很广泛，具体用到细讲。
	public static void main(String[] args) {//方括号（[]）：定义数组和访问数组元素时使用。
		//圆点（.）：类和对象访问它的成员时使用。（的） 
		System.out.print("haha");//分号（;）：语句的分割，表示一句话结束，好比咱们使用的句号。
	}
}
